accenturepoc/src/test/resources/Sample Mule Input XML.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/' xmlns:wsa='http://schemas.xmlsoap.org/ws/2004/08/addressing' xmlns:wsu='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd'>
	<SOAP-ENV:Header>
		<wsa:Consumer>ABC</wsa:Consumer>
		<wsa:Action>GetPayments</wsa:Action>
		<wsa:MessageID>Test1</wsa:MessageID>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<GetPaymentsRequest xmlns='http://rp.baml.com/data/GePaymentsRequestV001'>
			<BankServiceRequest>
				<RequestUniqueId>12345678901</RequestUniqueId>
				<CustomerLoginId>LoginId1</CustomerLoginId>
				<GetPaymentsRequestConcrete>
					<Account>
						<AccountNumber>3221</AccountNumber>
						<AccountIdLevel>S</AccountIdLevel>
						<AccountIdType/>
					</Account>
					<Account>
						<AccountNumber>32</AccountNumber>
						<AccountIdLevel>S</AccountIdLevel>
						<AccountIdType/>
					</Account>
				</GetPaymentsRequestConcrete>
			</BankServiceRequest>
		</GetPaymentsRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
